Revit 2024 API
LinePatternElement Class
 An element that represents a line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class LinePatternElement : Element
Visual Basic
Public Class LinePatternElement _
	Inherits Element
Visual C++
public ref class LinePatternElement : public Element
Remarks
 The LinePatternElement represents a line pattern in a project. It enables the user to retrieve, modify or create a line pattern in a project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.LinePatternElement
See Also
LinePatternElement Members
Autodesk.Revit.DB Namespace